/* automatically generated by rust-bindgen 0.69.4 */

pub const __has_safe_buffers: u32 = 1;
pub const __DARWIN_ONLY_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const __DARWIN_ONLY_VERS_1050: u32 = 1;
pub const __DARWIN_UNIX03: u32 = 1;
pub const __DARWIN_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_VERS_1050: u32 = 1;
pub const __DARWIN_NON_CANCELABLE: u32 = 0;
pub const __DARWIN_SUF_EXTSN: &[u8; 14] = b"$DARWIN_EXTSN\0";
pub const __DARWIN_C_ANSI: u32 = 4096;
pub const __DARWIN_C_FULL: u32 = 900000;
pub const __DARWIN_C_LEVEL: u32 = 900000;
pub const __STDC_WANT_LIB_EXT1__: u32 = 1;
pub const __DARWIN_NO_LONG_LONG: u32 = 0;
pub const _DARWIN_FEATURE_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_VERS_1050: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const _DARWIN_FEATURE_UNIX_CONFORMANCE: u32 = 3;
pub const __has_ptrcheck: u32 = 0;
pub const __API_TO_BE_DEPRECATED: u32 = 100000;
pub const __API_TO_BE_DEPRECATED_MACOS: u32 = 100000;
pub const __API_TO_BE_DEPRECATED_IOS: u32 = 100000;
pub const __API_TO_BE_DEPRECATED_MACCATALYST: u32 = 100000;
pub const __API_TO_BE_DEPRECATED_WATCHOS: u32 = 100000;
pub const __API_TO_BE_DEPRECATED_TVOS: u32 = 100000;
pub const __API_TO_BE_DEPRECATED_DRIVERKIT: u32 = 100000;
pub const __API_TO_BE_DEPRECATED_VISIONOS: u32 = 100000;
pub const __MAC_10_0: u32 = 1000;
pub const __MAC_10_1: u32 = 1010;

pub const OFF_MAX: u64 = 9223372036854775807;
pub const PASS_MAX: u32 = 128;
pub const NL_ARGMAX: u32 = 9;
pub const NL_LANGMAX: u32 = 14;
pub const NL_MSGMAX: u32 = 32767;
pub const NL_NMAX: u32 = 1;
pub const NL_SETMAX: u32 = 255;
pub const NL_TEXTMAX: u32 = 2048;
pub const _XOPEN_IOV_MAX: u32 = 16;
pub const IOV_MAX: u32 = 1024;
pub const _XOPEN_NAME_MAX: u32 = 255;
pub const _XOPEN_PATH_MAX: u32 = 1024;
pub const FLT_HAS_SUBNORM: u32 = 1;
pub const DBL_HAS_SUBNORM: u32 = 1;
pub const LDBL_HAS_SUBNORM: u32 = 1;
pub const __64BIT__: u32 = 1;
pub const TA_INTEGER_MIN: i32 = -2147483647;
pub const TA_INTEGER_MAX: u32 = 2147483647;
pub const TA_REAL_MIN: f64 = -30000000000000000000000000000000000000.0;
pub const TA_REAL_MAX: f64 = 30000000000000000000000000000000000000.0;
pub const TA_INTEGER_DEFAULT: i32 = -2147483648;
pub const TA_REAL_DEFAULT: f64 = -40000000000000000000000000000000000000.0;
pub const TA_FUNC_FLG_OVERLAP: u32 = 16777216;
pub const TA_FUNC_FLG_VOLUME: u32 = 67108864;
pub const TA_FUNC_FLG_UNST_PER: u32 = 134217728;
pub const TA_FUNC_FLG_CANDLESTICK: u32 = 268435456;
pub const TA_IN_PRICE_OPEN: u32 = 1;
pub const TA_IN_PRICE_HIGH: u32 = 2;
pub const TA_IN_PRICE_LOW: u32 = 4;
pub const TA_IN_PRICE_CLOSE: u32 = 8;
pub const TA_IN_PRICE_VOLUME: u32 = 16;
pub const TA_IN_PRICE_OPENINTEREST: u32 = 32;
pub const TA_IN_PRICE_TIMESTAMP: u32 = 64;
pub const TA_OPTIN_IS_PERCENT: u32 = 1048576;
pub const TA_OPTIN_IS_DEGREE: u32 = 2097152;
pub const TA_OPTIN_IS_CURRENCY: u32 = 4194304;
pub const TA_OPTIN_ADVANCED: u32 = 16777216;
pub const TA_OUT_LINE: u32 = 1;
pub const TA_OUT_DOT_LINE: u32 = 2;
pub const TA_OUT_DASH_LINE: u32 = 4;
pub const TA_OUT_DOT: u32 = 8;
pub const TA_OUT_HISTO: u32 = 16;
pub const TA_OUT_PATTERN_BOOL: u32 = 32;
pub const TA_OUT_PATTERN_BULL_BEAR: u32 = 64;
pub const TA_OUT_PATTERN_STRENGTH: u32 = 128;
pub const TA_OUT_POSITIVE: u32 = 256;
pub const TA_OUT_NEGATIVE: u32 = 512;
pub const TA_OUT_ZERO: u32 = 1024;
pub const TA_OUT_UPPER_LIMIT: u32 = 2048;
pub const TA_OUT_LOWER_LIMIT: u32 = 4096;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__mbstate8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstate8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mbstateL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(_mbstateL)
        )
    );
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[test]
fn bindgen_test_layout___darwin_pthread_handler_rec() {
    const UNINIT: ::std::mem::MaybeUninit<__darwin_pthread_handler_rec> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__darwin_pthread_handler_rec>(),
        24usize,
        concat!("Size of: ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        ::std::mem::align_of::<__darwin_pthread_handler_rec>(),
        8usize,
        concat!("Alignment of ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__routine) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__routine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__arg) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_attr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_attr_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_cond_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_condattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_condattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_condattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_mutex_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutex_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_mutexattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutexattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutexattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_once_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_once_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_once_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_once_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_rwlock_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlock_t>(),
        200usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_rwlockattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlockattr_t>(),
        24usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_t>(),
        8192usize,
        concat!("Size of: ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cleanup_stack) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__cleanup_stack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__opaque)
        )
    );
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type __darwin_nl_item = ::std::os::raw::c_int;
pub type __darwin_wctrans_t = ::std::os::raw::c_int;
pub type __darwin_wctype_t = __uint32_t;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type va_list = __darwin_va_list;
extern "C" {
    pub fn renameat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renamex_np(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameatx_np(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___sbuf() {
    const UNINIT: ::std::mem::MaybeUninit<__sbuf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sbuf>(),
        16usize,
        concat!("Size of: ", stringify!(__sbuf))
    );
    assert_eq!(
        ::std::mem::align_of::<__sbuf>(),
        8usize,
        concat!("Alignment of ", stringify!(__sbuf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: fpos_t,
            arg3: ::std::os::raw::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
}
#[test]
fn bindgen_test_layout___sFILE() {
    const UNINIT: ::std::mem::MaybeUninit<__sFILE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sFILE>(),
        152usize,
        concat!("Size of: ", stringify!(__sFILE))
    );
    assert_eq!(
        ::std::mem::align_of::<__sFILE>(),
        8usize,
        concat!("Alignment of ", stringify!(__sFILE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._p) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_p)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._r) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._w) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_w)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._file) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._bf) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_bf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lbfsize) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lbfsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cookie) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_cookie)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._close) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_close)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._read) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._seek) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_seek)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._write) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_write)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ub) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ub)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._extra) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_extra)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ur) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ur)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ubuf) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ubuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._nbuf) as usize - ptr as usize },
        119usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_nbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lb) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._blksize) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_blksize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_offset)
        )
    );
}
pub type FILE = __sFILE;
extern "C" {
    pub static mut __stdinp: *mut FILE;
}
extern "C" {
    pub static mut __stdoutp: *mut FILE;
}
extern "C" {
    pub static mut __stderrp: *mut FILE;
}
extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputs(arg1: *const ::std::os::raw::c_char, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn freopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::std::os::raw::c_long,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gets(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn perror(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn putc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn remove(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
extern "C" {
    pub fn scanf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ungetc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        arg1: *const ::std::os::raw::c_char,
        arg2: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fdopen(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn __srget(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __svfscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __swbuf(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __prefix: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type off_t = __darwin_off_t;
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __offset: off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> off_t;
}
extern "C" {
    pub fn snprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __str: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdelim(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> isize;
}
extern "C" {
    pub fn getline(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut usize,
        __stream: *mut FILE,
    ) -> isize;
}
extern "C" {
    pub fn fmemopen(
        __buf: *mut ::std::os::raw::c_void,
        __size: usize,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufp: *mut *mut ::std::os::raw::c_char,
        __sizep: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub static sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    pub static sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid_r(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fgetln(arg1: *mut FILE, arg2: *mut usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fmtcheck(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funopen(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_char,
                arg3: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_char,
                arg3: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg4: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: fpos_t,
                arg3: ::std::os::raw::c_int,
            ) -> fpos_t,
        >,
        arg5: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    ) -> *mut FILE;
}
extern "C" {
    pub fn __sprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __snprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: ::std::os::raw::c_int,
        arg4: usize,
        arg5: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __vsprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __vsnprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: ::std::os::raw::c_int,
        arg4: usize,
        arg5: *const ::std::os::raw::c_char,
        arg6: va_list,
    ) -> ::std::os::raw::c_int;
}
pub type Int32 = ::std::os::raw::c_int;
pub type UInt32 = ::std::os::raw::c_uint;
pub type Int64 = ::std::os::raw::c_long;
pub type UInt64 = ::std::os::raw::c_ulong;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum TA_RetCode {
    TA_SUCCESS = 0,
    TA_LIB_NOT_INITIALIZE = 1,
    TA_BAD_PARAM = 2,
    TA_ALLOC_ERR = 3,
    TA_GROUP_NOT_FOUND = 4,
    TA_FUNC_NOT_FOUND = 5,
    TA_INVALID_HANDLE = 6,
    TA_INVALID_PARAM_HOLDER = 7,
    TA_INVALID_PARAM_HOLDER_TYPE = 8,
    TA_INVALID_PARAM_FUNCTION = 9,
    TA_INPUT_NOT_ALL_INITIALIZE = 10,
    TA_OUTPUT_NOT_ALL_INITIALIZE = 11,
    TA_OUT_OF_RANGE_START_INDEX = 12,
    TA_OUT_OF_RANGE_END_INDEX = 13,
    TA_INVALID_LIST_TYPE = 14,
    TA_BAD_OBJECT = 15,
    TA_NOT_SUPPORTED = 16,
    TA_INTERNAL_ERROR = 5000,
    TA_UNKNOWN_ERR = 65535,
}
pub const TA_Compatibility_TA_COMPATIBILITY_DEFAULT: TA_Compatibility = 0;
pub const TA_Compatibility_TA_COMPATIBILITY_METASTOCK: TA_Compatibility = 1;
pub type TA_Compatibility = ::std::os::raw::c_uint;
pub const TA_MAType_TA_MAType_SMA: TA_MAType = 0;
pub const TA_MAType_TA_MAType_EMA: TA_MAType = 1;
pub const TA_MAType_TA_MAType_WMA: TA_MAType = 2;
pub const TA_MAType_TA_MAType_DEMA: TA_MAType = 3;
pub const TA_MAType_TA_MAType_TEMA: TA_MAType = 4;
pub const TA_MAType_TA_MAType_TRIMA: TA_MAType = 5;
pub const TA_MAType_TA_MAType_KAMA: TA_MAType = 6;
pub const TA_MAType_TA_MAType_MAMA: TA_MAType = 7;
pub const TA_MAType_TA_MAType_T3: TA_MAType = 8;
pub type TA_MAType = ::std::os::raw::c_uint;
pub const TA_FuncUnstId_TA_FUNC_UNST_ADX: TA_FuncUnstId = 0;
pub const TA_FuncUnstId_TA_FUNC_UNST_ADXR: TA_FuncUnstId = 1;
pub const TA_FuncUnstId_TA_FUNC_UNST_ATR: TA_FuncUnstId = 2;
pub const TA_FuncUnstId_TA_FUNC_UNST_CMO: TA_FuncUnstId = 3;
pub const TA_FuncUnstId_TA_FUNC_UNST_DX: TA_FuncUnstId = 4;
pub const TA_FuncUnstId_TA_FUNC_UNST_EMA: TA_FuncUnstId = 5;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_DCPERIOD: TA_FuncUnstId = 6;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_DCPHASE: TA_FuncUnstId = 7;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_PHASOR: TA_FuncUnstId = 8;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_SINE: TA_FuncUnstId = 9;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_TRENDLINE: TA_FuncUnstId = 10;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_TRENDMODE: TA_FuncUnstId = 11;
pub const TA_FuncUnstId_TA_FUNC_UNST_KAMA: TA_FuncUnstId = 12;
pub const TA_FuncUnstId_TA_FUNC_UNST_MAMA: TA_FuncUnstId = 13;
pub const TA_FuncUnstId_TA_FUNC_UNST_MFI: TA_FuncUnstId = 14;
pub const TA_FuncUnstId_TA_FUNC_UNST_MINUS_DI: TA_FuncUnstId = 15;
pub const TA_FuncUnstId_TA_FUNC_UNST_MINUS_DM: TA_FuncUnstId = 16;
pub const TA_FuncUnstId_TA_FUNC_UNST_NATR: TA_FuncUnstId = 17;
pub const TA_FuncUnstId_TA_FUNC_UNST_PLUS_DI: TA_FuncUnstId = 18;
pub const TA_FuncUnstId_TA_FUNC_UNST_PLUS_DM: TA_FuncUnstId = 19;
pub const TA_FuncUnstId_TA_FUNC_UNST_RSI: TA_FuncUnstId = 20;
pub const TA_FuncUnstId_TA_FUNC_UNST_STOCHRSI: TA_FuncUnstId = 21;
pub const TA_FuncUnstId_TA_FUNC_UNST_T3: TA_FuncUnstId = 22;
pub const TA_FuncUnstId_TA_FUNC_UNST_ALL: TA_FuncUnstId = 23;
pub const TA_FuncUnstId_TA_FUNC_UNST_NONE: TA_FuncUnstId = -1;
pub type TA_FuncUnstId = ::std::os::raw::c_int;
pub const TA_RangeType_TA_RangeType_RealBody: TA_RangeType = 0;
pub const TA_RangeType_TA_RangeType_HighLow: TA_RangeType = 1;
pub const TA_RangeType_TA_RangeType_Shadows: TA_RangeType = 2;
pub type TA_RangeType = ::std::os::raw::c_uint;
pub const TA_CandleSettingType_TA_BodyLong: TA_CandleSettingType = 0;
pub const TA_CandleSettingType_TA_BodyVeryLong: TA_CandleSettingType = 1;
pub const TA_CandleSettingType_TA_BodyShort: TA_CandleSettingType = 2;
pub const TA_CandleSettingType_TA_BodyDoji: TA_CandleSettingType = 3;
pub const TA_CandleSettingType_TA_ShadowLong: TA_CandleSettingType = 4;
pub const TA_CandleSettingType_TA_ShadowVeryLong: TA_CandleSettingType = 5;
pub const TA_CandleSettingType_TA_ShadowShort: TA_CandleSettingType = 6;
pub const TA_CandleSettingType_TA_ShadowVeryShort: TA_CandleSettingType = 7;
pub const TA_CandleSettingType_TA_Near: TA_CandleSettingType = 8;
pub const TA_CandleSettingType_TA_Far: TA_CandleSettingType = 9;
pub const TA_CandleSettingType_TA_Equal: TA_CandleSettingType = 10;
pub const TA_CandleSettingType_TA_AllCandleSettings: TA_CandleSettingType = 11;
pub type TA_CandleSettingType = ::std::os::raw::c_uint;
extern "C" {
    pub fn TA_GetVersionString() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TA_GetVersionMajor() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TA_GetVersionMinor() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TA_GetVersionBuild() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TA_GetVersionDate() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TA_GetVersionTime() -> *const ::std::os::raw::c_char;
}
pub type TA_Real = f64;
pub type TA_Integer = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_StringTable {
    pub size: ::std::os::raw::c_uint,
    pub string: *mut *const ::std::os::raw::c_char,
    pub hiddenData: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_TA_StringTable() {
    const UNINIT: ::std::mem::MaybeUninit<TA_StringTable> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_StringTable>(),
        24usize,
        concat!("Size of: ", stringify!(TA_StringTable))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_StringTable>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_StringTable))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_StringTable),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).string) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_StringTable),
            "::",
            stringify!(string)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hiddenData) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_StringTable),
            "::",
            stringify!(hiddenData)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_RetCodeInfo {
    pub enumStr: *const ::std::os::raw::c_char,
    pub infoStr: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_TA_RetCodeInfo() {
    const UNINIT: ::std::mem::MaybeUninit<TA_RetCodeInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_RetCodeInfo>(),
        16usize,
        concat!("Size of: ", stringify!(TA_RetCodeInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_RetCodeInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_RetCodeInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enumStr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RetCodeInfo),
            "::",
            stringify!(enumStr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).infoStr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RetCodeInfo),
            "::",
            stringify!(infoStr)
        )
    );
}
extern "C" {
    pub fn TA_SetRetCodeInfo(theRetCode: TA_RetCode, retCodeInfo: *mut TA_RetCodeInfo);
}
extern "C" {
    pub fn TA_Initialize() -> TA_RetCode;
}
extern "C" {
    pub fn TA_Shutdown() -> TA_RetCode;
}
extern "C" {
    pub fn TA_GroupTableAlloc(table: *mut *mut TA_StringTable) -> TA_RetCode;
}
extern "C" {
    pub fn TA_GroupTableFree(table: *mut TA_StringTable) -> TA_RetCode;
}
extern "C" {
    pub fn TA_FuncTableAlloc(
        group: *const ::std::os::raw::c_char,
        table: *mut *mut TA_StringTable,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_FuncTableFree(table: *mut TA_StringTable) -> TA_RetCode;
}
pub type TA_FuncHandle = ::std::os::raw::c_uint;
extern "C" {
    pub fn TA_GetFuncHandle(
        name: *const ::std::os::raw::c_char,
        handle: *mut *const TA_FuncHandle,
    ) -> TA_RetCode;
}
pub type TA_FuncFlags = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_FuncInfo {
    pub name: *const ::std::os::raw::c_char,
    pub group: *const ::std::os::raw::c_char,
    pub hint: *const ::std::os::raw::c_char,
    pub camelCaseName: *const ::std::os::raw::c_char,
    pub flags: TA_FuncFlags,
    pub nbInput: ::std::os::raw::c_uint,
    pub nbOptInput: ::std::os::raw::c_uint,
    pub nbOutput: ::std::os::raw::c_uint,
    pub handle: *const TA_FuncHandle,
}
#[test]
fn bindgen_test_layout_TA_FuncInfo() {
    const UNINIT: ::std::mem::MaybeUninit<TA_FuncInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_FuncInfo>(),
        56usize,
        concat!("Size of: ", stringify!(TA_FuncInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_FuncInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_FuncInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).group) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hint) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(hint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).camelCaseName) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(camelCaseName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nbInput) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(nbInput)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nbOptInput) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(nbOptInput)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nbOutput) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(nbOutput)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(handle)
        )
    );
}
extern "C" {
    pub fn TA_GetFuncInfo(
        handle: *const TA_FuncHandle,
        funcInfo: *mut *const TA_FuncInfo,
    ) -> TA_RetCode;
}
pub type TA_CallForEachFunc = ::std::option::Option<
    unsafe extern "C" fn(funcInfo: *const TA_FuncInfo, opaqueData: *mut ::std::os::raw::c_void),
>;
extern "C" {
    pub fn TA_ForEachFunc(
        functionToCall: TA_CallForEachFunc,
        opaqueData: *mut ::std::os::raw::c_void,
    ) -> TA_RetCode;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_RealRange {
    pub min: TA_Real,
    pub max: TA_Real,
    pub precision: TA_Integer,
    pub suggested_start: TA_Real,
    pub suggested_end: TA_Real,
    pub suggested_increment: TA_Real,
}
#[test]
fn bindgen_test_layout_TA_RealRange() {
    const UNINIT: ::std::mem::MaybeUninit<TA_RealRange> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_RealRange>(),
        48usize,
        concat!("Size of: ", stringify!(TA_RealRange))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_RealRange>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_RealRange))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealRange),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealRange),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).precision) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealRange),
            "::",
            stringify!(precision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suggested_start) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealRange),
            "::",
            stringify!(suggested_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suggested_end) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealRange),
            "::",
            stringify!(suggested_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suggested_increment) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealRange),
            "::",
            stringify!(suggested_increment)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_IntegerRange {
    pub min: TA_Integer,
    pub max: TA_Integer,
    pub suggested_start: TA_Integer,
    pub suggested_end: TA_Integer,
    pub suggested_increment: TA_Integer,
}
#[test]
fn bindgen_test_layout_TA_IntegerRange() {
    const UNINIT: ::std::mem::MaybeUninit<TA_IntegerRange> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_IntegerRange>(),
        20usize,
        concat!("Size of: ", stringify!(TA_IntegerRange))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_IntegerRange>(),
        4usize,
        concat!("Alignment of ", stringify!(TA_IntegerRange))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerRange),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerRange),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suggested_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerRange),
            "::",
            stringify!(suggested_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suggested_end) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerRange),
            "::",
            stringify!(suggested_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suggested_increment) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerRange),
            "::",
            stringify!(suggested_increment)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_RealDataPair {
    pub value: TA_Real,
    pub string: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_TA_RealDataPair() {
    const UNINIT: ::std::mem::MaybeUninit<TA_RealDataPair> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_RealDataPair>(),
        16usize,
        concat!("Size of: ", stringify!(TA_RealDataPair))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_RealDataPair>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_RealDataPair))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealDataPair),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).string) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealDataPair),
            "::",
            stringify!(string)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_IntegerDataPair {
    pub value: TA_Integer,
    pub string: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_TA_IntegerDataPair() {
    const UNINIT: ::std::mem::MaybeUninit<TA_IntegerDataPair> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_IntegerDataPair>(),
        16usize,
        concat!("Size of: ", stringify!(TA_IntegerDataPair))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_IntegerDataPair>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_IntegerDataPair))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerDataPair),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).string) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerDataPair),
            "::",
            stringify!(string)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_RealList {
    pub data: *const TA_RealDataPair,
    pub nbElement: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_TA_RealList() {
    const UNINIT: ::std::mem::MaybeUninit<TA_RealList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_RealList>(),
        16usize,
        concat!("Size of: ", stringify!(TA_RealList))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_RealList>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_RealList))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealList),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nbElement) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealList),
            "::",
            stringify!(nbElement)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_IntegerList {
    pub data: *const TA_IntegerDataPair,
    pub nbElement: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_TA_IntegerList() {
    const UNINIT: ::std::mem::MaybeUninit<TA_IntegerList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_IntegerList>(),
        16usize,
        concat!("Size of: ", stringify!(TA_IntegerList))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_IntegerList>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_IntegerList))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerList),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nbElement) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerList),
            "::",
            stringify!(nbElement)
        )
    );
}
pub const TA_InputParameterType_TA_Input_Price: TA_InputParameterType = 0;
pub const TA_InputParameterType_TA_Input_Real: TA_InputParameterType = 1;
pub const TA_InputParameterType_TA_Input_Integer: TA_InputParameterType = 2;
pub type TA_InputParameterType = ::std::os::raw::c_uint;
pub const TA_OptInputParameterType_TA_OptInput_RealRange: TA_OptInputParameterType = 0;
pub const TA_OptInputParameterType_TA_OptInput_RealList: TA_OptInputParameterType = 1;
pub const TA_OptInputParameterType_TA_OptInput_IntegerRange: TA_OptInputParameterType = 2;
pub const TA_OptInputParameterType_TA_OptInput_IntegerList: TA_OptInputParameterType = 3;
pub type TA_OptInputParameterType = ::std::os::raw::c_uint;
pub const TA_OutputParameterType_TA_Output_Real: TA_OutputParameterType = 0;
pub const TA_OutputParameterType_TA_Output_Integer: TA_OutputParameterType = 1;
pub type TA_OutputParameterType = ::std::os::raw::c_uint;
pub type TA_InputFlags = ::std::os::raw::c_int;
pub type TA_OptInputFlags = ::std::os::raw::c_int;
pub type TA_OutputFlags = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_InputParameterInfo {
    pub type_: TA_InputParameterType,
    pub paramName: *const ::std::os::raw::c_char,
    pub flags: TA_InputFlags,
}
#[test]
fn bindgen_test_layout_TA_InputParameterInfo() {
    const UNINIT: ::std::mem::MaybeUninit<TA_InputParameterInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_InputParameterInfo>(),
        24usize,
        concat!("Size of: ", stringify!(TA_InputParameterInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_InputParameterInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_InputParameterInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_InputParameterInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).paramName) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_InputParameterInfo),
            "::",
            stringify!(paramName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_InputParameterInfo),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_OptInputParameterInfo {
    pub type_: TA_OptInputParameterType,
    pub paramName: *const ::std::os::raw::c_char,
    pub flags: TA_OptInputFlags,
    pub displayName: *const ::std::os::raw::c_char,
    pub dataSet: *const ::std::os::raw::c_void,
    pub defaultValue: TA_Real,
    pub hint: *const ::std::os::raw::c_char,
    pub helpFile: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_TA_OptInputParameterInfo() {
    const UNINIT: ::std::mem::MaybeUninit<TA_OptInputParameterInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_OptInputParameterInfo>(),
        64usize,
        concat!("Size of: ", stringify!(TA_OptInputParameterInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_OptInputParameterInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_OptInputParameterInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).paramName) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(paramName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).displayName) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(displayName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataSet) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(dataSet)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).defaultValue) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(defaultValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hint) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(hint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).helpFile) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(helpFile)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_OutputParameterInfo {
    pub type_: TA_OutputParameterType,
    pub paramName: *const ::std::os::raw::c_char,
    pub flags: TA_OutputFlags,
}
#[test]
fn bindgen_test_layout_TA_OutputParameterInfo() {
    const UNINIT: ::std::mem::MaybeUninit<TA_OutputParameterInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_OutputParameterInfo>(),
        24usize,
        concat!("Size of: ", stringify!(TA_OutputParameterInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_OutputParameterInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_OutputParameterInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OutputParameterInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).paramName) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OutputParameterInfo),
            "::",
            stringify!(paramName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OutputParameterInfo),
            "::",
            stringify!(flags)
        )
    );
}
extern "C" {
    pub fn TA_GetInputParameterInfo(
        handle: *const TA_FuncHandle,
        paramIndex: ::std::os::raw::c_uint,
        info: *mut *const TA_InputParameterInfo,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_GetOptInputParameterInfo(
        handle: *const TA_FuncHandle,
        paramIndex: ::std::os::raw::c_uint,
        info: *mut *const TA_OptInputParameterInfo,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_GetOutputParameterInfo(
        handle: *const TA_FuncHandle,
        paramIndex: ::std::os::raw::c_uint,
        info: *mut *const TA_OutputParameterInfo,
    ) -> TA_RetCode;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_ParamHolder {
    pub hiddenData: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_TA_ParamHolder() {
    const UNINIT: ::std::mem::MaybeUninit<TA_ParamHolder> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_ParamHolder>(),
        8usize,
        concat!("Size of: ", stringify!(TA_ParamHolder))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_ParamHolder>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_ParamHolder))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hiddenData) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_ParamHolder),
            "::",
            stringify!(hiddenData)
        )
    );
}
extern "C" {
    pub fn TA_ParamHolderAlloc(
        handle: *const TA_FuncHandle,
        allocatedParams: *mut *mut TA_ParamHolder,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_ParamHolderFree(params: *mut TA_ParamHolder) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SetInputParamIntegerPtr(
        params: *mut TA_ParamHolder,
        paramIndex: ::std::os::raw::c_uint,
        value: *const TA_Integer,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SetInputParamRealPtr(
        params: *mut TA_ParamHolder,
        paramIndex: ::std::os::raw::c_uint,
        value: *const TA_Real,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SetInputParamPricePtr(
        params: *mut TA_ParamHolder,
        paramIndex: ::std::os::raw::c_uint,
        open: *const TA_Real,
        high: *const TA_Real,
        low: *const TA_Real,
